app/views/static_pages/index.html.erb

    Your Shelves!
    <% current_user.shelves.each do |shelf| %>
    <%= shelf.title %>
      <% shelf.books.each do |book| %>
---
SELECT "shelves".* FROM "shelves" WHERE "shelves"."user_id" = $1  [["user_id", 1]]
SELECT "books".* FROM "books" INNER JOIN "shelvings" ON "books"."id" = "shelvings"."book_id" WHERE "shelvings"."shelf_id" = $1  [["shelf_id", 1]]