app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "X5Z7GE8FXx5nxcMyu9FVgw"], ["updated_at", "2015-11-17 16:14:40.830997"], ["id", 22]]
---
  def create
    @user = User.create(user_params)
    if @user.save